app/controllers/voicemails_controller.rb

  def index
    @voicemails = Voicemail.all
---
SELECT "voicemails".* FROM "voicemails"

  def create
    @voicemail = Voicemail.new(params[:voicemail])

    respond_to do |format|
      if @voicemail.save
---
INSERT INTO "voicemails" ("attachment_content_type", "attachment_file_name", "attachment_file_size", "attachment_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def destroy
    @voicemail = Voicemail.find(params[:id])
    @voicemail.destroy
---
SELECT "voicemails".* FROM "voicemails" WHERE "voicemails"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "voicemails" WHERE "voicemails"."id" = $1  [["id", 1]]